# ConduitType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitType Class
Members See Also
---
This class represents a conduit type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ConduitType : MEPCurveType
```

Visual Basic
---
```text
Public Class ConduitType _
	Inherits MEPCurveType
```

Visual C++
---
```text
public ref class ConduitType : public MEPCurveType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..MEPCurveType Autodesk.Revit.DB.Electrical..::..ConduitType
# See Also
ConduitType Members
Autodesk.Revit.DB.Electrical Namespace